###################################################################

# Created by write_sdc on Thu Apr 13 14:53:43 2023

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_fanout 20 [current_design]
set_max_transition 0.75 [current_design]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {clk[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {reset[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[69]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[68]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[67]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[66]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[65]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[64]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[63]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[62]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[61]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[60]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[59]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[58]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[57]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[56]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[55]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[54]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[53]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[52]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[51]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[50]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[49]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[48]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[47]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[46]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[45]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[44]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[43]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[42]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[41]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[40]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[39]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[38]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[37]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[36]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[35]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[34]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[33]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[32]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[31]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[30]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[29]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[28]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[27]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[26]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[25]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[24]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[23]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[22]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[21]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[20]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[19]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[18]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[17]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[16]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[15]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[14]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[13]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[12]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[11]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[10]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[9]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[8]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[7]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[6]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[5]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[4]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[3]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[2]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[1]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_msg[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {istream_val[0]}]
set_driving_cell -lib_cell INV_X2 -no_design_rule [get_ports {ostream_rdy[0]}]
set_load -pin_load 7 [get_ports {istream_rdy[0]}]
set_load -pin_load 7 [get_ports {ostream_msg[34]}]
set_load -pin_load 7 [get_ports {ostream_msg[33]}]
set_load -pin_load 7 [get_ports {ostream_msg[32]}]
set_load -pin_load 7 [get_ports {ostream_msg[31]}]
set_load -pin_load 7 [get_ports {ostream_msg[30]}]
set_load -pin_load 7 [get_ports {ostream_msg[29]}]
set_load -pin_load 7 [get_ports {ostream_msg[28]}]
set_load -pin_load 7 [get_ports {ostream_msg[27]}]
set_load -pin_load 7 [get_ports {ostream_msg[26]}]
set_load -pin_load 7 [get_ports {ostream_msg[25]}]
set_load -pin_load 7 [get_ports {ostream_msg[24]}]
set_load -pin_load 7 [get_ports {ostream_msg[23]}]
set_load -pin_load 7 [get_ports {ostream_msg[22]}]
set_load -pin_load 7 [get_ports {ostream_msg[21]}]
set_load -pin_load 7 [get_ports {ostream_msg[20]}]
set_load -pin_load 7 [get_ports {ostream_msg[19]}]
set_load -pin_load 7 [get_ports {ostream_msg[18]}]
set_load -pin_load 7 [get_ports {ostream_msg[17]}]
set_load -pin_load 7 [get_ports {ostream_msg[16]}]
set_load -pin_load 7 [get_ports {ostream_msg[15]}]
set_load -pin_load 7 [get_ports {ostream_msg[14]}]
set_load -pin_load 7 [get_ports {ostream_msg[13]}]
set_load -pin_load 7 [get_ports {ostream_msg[12]}]
set_load -pin_load 7 [get_ports {ostream_msg[11]}]
set_load -pin_load 7 [get_ports {ostream_msg[10]}]
set_load -pin_load 7 [get_ports {ostream_msg[9]}]
set_load -pin_load 7 [get_ports {ostream_msg[8]}]
set_load -pin_load 7 [get_ports {ostream_msg[7]}]
set_load -pin_load 7 [get_ports {ostream_msg[6]}]
set_load -pin_load 7 [get_ports {ostream_msg[5]}]
set_load -pin_load 7 [get_ports {ostream_msg[4]}]
set_load -pin_load 7 [get_ports {ostream_msg[3]}]
set_load -pin_load 7 [get_ports {ostream_msg[2]}]
set_load -pin_load 7 [get_ports {ostream_msg[1]}]
set_load -pin_load 7 [get_ports {ostream_msg[0]}]
set_load -pin_load 7 [get_ports {ostream_val[0]}]
create_clock [get_ports {clk[0]}]  -name ideal_clock  -period 3  -waveform {0 1.5}
group_path -name FEEDTHROUGH  -from [list [get_ports {reset[0]}] [get_ports {istream_msg[69]}] [get_ports {istream_msg[68]}] [get_ports {istream_msg[67]}] [get_ports {istream_msg[66]}] [get_ports {istream_msg[65]}] [get_ports {istream_msg[64]}] [get_ports {istream_msg[63]}] [get_ports {istream_msg[62]}] [get_ports {istream_msg[61]}] [get_ports {istream_msg[60]}] [get_ports {istream_msg[59]}] [get_ports {istream_msg[58]}] [get_ports {istream_msg[57]}] [get_ports {istream_msg[56]}] [get_ports {istream_msg[55]}] [get_ports {istream_msg[54]}] [get_ports {istream_msg[53]}] [get_ports {istream_msg[52]}] [get_ports {istream_msg[51]}] [get_ports {istream_msg[50]}] [get_ports {istream_msg[49]}] [get_ports {istream_msg[48]}] [get_ports {istream_msg[47]}] [get_ports {istream_msg[46]}] [get_ports {istream_msg[45]}] [get_ports {istream_msg[44]}] [get_ports {istream_msg[43]}] [get_ports {istream_msg[42]}] [get_ports {istream_msg[41]}] [get_ports {istream_msg[40]}] [get_ports {istream_msg[39]}] [get_ports {istream_msg[38]}] [get_ports {istream_msg[37]}] [get_ports {istream_msg[36]}] [get_ports {istream_msg[35]}] [get_ports {istream_msg[34]}] [get_ports {istream_msg[33]}] [get_ports {istream_msg[32]}] [get_ports {istream_msg[31]}] [get_ports {istream_msg[30]}] [get_ports {istream_msg[29]}] [get_ports {istream_msg[28]}] [get_ports {istream_msg[27]}] [get_ports {istream_msg[26]}] [get_ports {istream_msg[25]}] [get_ports {istream_msg[24]}] [get_ports {istream_msg[23]}] [get_ports {istream_msg[22]}] [get_ports {istream_msg[21]}] [get_ports {istream_msg[20]}] [get_ports {istream_msg[19]}] [get_ports {istream_msg[18]}] [get_ports {istream_msg[17]}] [get_ports {istream_msg[16]}] [get_ports {istream_msg[15]}] [get_ports {istream_msg[14]}] [get_ports {istream_msg[13]}] [get_ports {istream_msg[12]}] [get_ports {istream_msg[11]}] [get_ports {istream_msg[10]}] [get_ports {istream_msg[9]}] [get_ports {istream_msg[8]}] [get_ports {istream_msg[7]}] [get_ports {istream_msg[6]}] [get_ports {istream_msg[5]}] [get_ports {istream_msg[4]}] [get_ports {istream_msg[3]}] [get_ports {istream_msg[2]}] [get_ports {istream_msg[1]}] [get_ports {istream_msg[0]}] [get_ports {istream_val[0]}] [get_ports {ostream_rdy[0]}]]  -to [list [get_ports {istream_rdy[0]}] [get_ports {ostream_msg[34]}] [get_ports {ostream_msg[33]}] [get_ports {ostream_msg[32]}] [get_ports {ostream_msg[31]}] [get_ports {ostream_msg[30]}] [get_ports {ostream_msg[29]}] [get_ports {ostream_msg[28]}] [get_ports {ostream_msg[27]}] [get_ports {ostream_msg[26]}] [get_ports {ostream_msg[25]}] [get_ports {ostream_msg[24]}] [get_ports {ostream_msg[23]}] [get_ports {ostream_msg[22]}] [get_ports {ostream_msg[21]}] [get_ports {ostream_msg[20]}] [get_ports {ostream_msg[19]}] [get_ports {ostream_msg[18]}] [get_ports {ostream_msg[17]}] [get_ports {ostream_msg[16]}] [get_ports {ostream_msg[15]}] [get_ports {ostream_msg[14]}] [get_ports {ostream_msg[13]}] [get_ports {ostream_msg[12]}] [get_ports {ostream_msg[11]}] [get_ports {ostream_msg[10]}] [get_ports {ostream_msg[9]}] [get_ports {ostream_msg[8]}] [get_ports {ostream_msg[7]}] [get_ports {ostream_msg[6]}] [get_ports {ostream_msg[5]}] [get_ports {ostream_msg[4]}] [get_ports {ostream_msg[3]}] [get_ports {ostream_msg[2]}] [get_ports {ostream_msg[1]}] [get_ports {ostream_msg[0]}] [get_ports {ostream_val[0]}]]
group_path -name REG2REG  -from [list [get_cells v/fn_reg/q_reg_0_] [get_cells v/fn_reg/q_reg_1_] [get_cells v/fn_reg/q_reg_2_] [get_cells v/fn_reg/q_reg_3_] [get_cells v/fn_reg/q_reg_4_] [get_cells v/fn_reg/q_reg_5_] [get_cells v/in1_reg/q_reg_0_] [get_cells v/in1_reg/q_reg_1_] [get_cells v/in1_reg/q_reg_2_] [get_cells v/in1_reg/q_reg_3_] [get_cells v/in1_reg/q_reg_4_] [get_cells v/in1_reg/q_reg_5_] [get_cells v/in1_reg/q_reg_6_] [get_cells v/in1_reg/q_reg_7_] [get_cells v/in1_reg/q_reg_8_] [get_cells v/in1_reg/q_reg_9_] [get_cells v/in1_reg/q_reg_10_] [get_cells v/in1_reg/q_reg_11_] [get_cells v/in1_reg/q_reg_12_] [get_cells v/in1_reg/q_reg_13_] [get_cells v/in1_reg/q_reg_14_] [get_cells v/in1_reg/q_reg_15_] [get_cells v/in1_reg/q_reg_16_] [get_cells v/in1_reg/q_reg_17_] [get_cells v/in1_reg/q_reg_18_] [get_cells v/in1_reg/q_reg_19_] [get_cells v/in1_reg/q_reg_20_] [get_cells v/in1_reg/q_reg_21_] [get_cells v/in1_reg/q_reg_22_] [get_cells v/in1_reg/q_reg_23_] [get_cells v/in1_reg/q_reg_24_] [get_cells v/in1_reg/q_reg_25_] [get_cells v/in1_reg/q_reg_26_] [get_cells v/in1_reg/q_reg_27_] [get_cells v/in1_reg/q_reg_28_] [get_cells v/in1_reg/q_reg_29_] [get_cells v/in1_reg/q_reg_30_] [get_cells v/in1_reg/q_reg_31_] [get_cells v/in0_reg/q_reg_0_] [get_cells v/in0_reg/q_reg_1_] [get_cells v/in0_reg/q_reg_2_] [get_cells v/in0_reg/q_reg_3_] [get_cells v/in0_reg/q_reg_4_] [get_cells v/in0_reg/q_reg_5_] [get_cells v/in0_reg/q_reg_6_] [get_cells v/in0_reg/q_reg_7_] [get_cells v/in0_reg/q_reg_8_] [get_cells v/in0_reg/q_reg_9_] [get_cells v/in0_reg/q_reg_10_] [get_cells v/in0_reg/q_reg_11_] [get_cells v/in0_reg/q_reg_12_] [get_cells v/in0_reg/q_reg_13_] [get_cells v/in0_reg/q_reg_14_] [get_cells v/in0_reg/q_reg_15_] [get_cells v/in0_reg/q_reg_16_] [get_cells v/in0_reg/q_reg_17_] [get_cells v/in0_reg/q_reg_18_] [get_cells v/in0_reg/q_reg_19_] [get_cells v/in0_reg/q_reg_20_] [get_cells v/in0_reg/q_reg_21_] [get_cells v/in0_reg/q_reg_22_] [get_cells v/in0_reg/q_reg_23_] [get_cells v/in0_reg/q_reg_24_] [get_cells v/in0_reg/q_reg_25_] [get_cells v/in0_reg/q_reg_26_] [get_cells v/in0_reg/q_reg_27_] [get_cells v/in0_reg/q_reg_28_] [get_cells v/in0_reg/q_reg_29_] [get_cells v/in0_reg/q_reg_30_] [get_cells v/in0_reg/q_reg_31_] [get_cells v/val_reg/q_reg_0_]]  -to [list [get_cells v/fn_reg/q_reg_0_] [get_cells v/fn_reg/q_reg_1_] [get_cells v/fn_reg/q_reg_2_] [get_cells v/fn_reg/q_reg_3_] [get_cells v/fn_reg/q_reg_4_] [get_cells v/fn_reg/q_reg_5_] [get_cells v/in1_reg/q_reg_0_] [get_cells v/in1_reg/q_reg_1_] [get_cells v/in1_reg/q_reg_2_] [get_cells v/in1_reg/q_reg_3_] [get_cells v/in1_reg/q_reg_4_] [get_cells v/in1_reg/q_reg_5_] [get_cells v/in1_reg/q_reg_6_] [get_cells v/in1_reg/q_reg_7_] [get_cells v/in1_reg/q_reg_8_] [get_cells v/in1_reg/q_reg_9_] [get_cells v/in1_reg/q_reg_10_] [get_cells v/in1_reg/q_reg_11_] [get_cells v/in1_reg/q_reg_12_] [get_cells v/in1_reg/q_reg_13_] [get_cells v/in1_reg/q_reg_14_] [get_cells v/in1_reg/q_reg_15_] [get_cells v/in1_reg/q_reg_16_] [get_cells v/in1_reg/q_reg_17_] [get_cells v/in1_reg/q_reg_18_] [get_cells v/in1_reg/q_reg_19_] [get_cells v/in1_reg/q_reg_20_] [get_cells v/in1_reg/q_reg_21_] [get_cells v/in1_reg/q_reg_22_] [get_cells v/in1_reg/q_reg_23_] [get_cells v/in1_reg/q_reg_24_] [get_cells v/in1_reg/q_reg_25_] [get_cells v/in1_reg/q_reg_26_] [get_cells v/in1_reg/q_reg_27_] [get_cells v/in1_reg/q_reg_28_] [get_cells v/in1_reg/q_reg_29_] [get_cells v/in1_reg/q_reg_30_] [get_cells v/in1_reg/q_reg_31_] [get_cells v/in0_reg/q_reg_0_] [get_cells v/in0_reg/q_reg_1_] [get_cells v/in0_reg/q_reg_2_] [get_cells v/in0_reg/q_reg_3_] [get_cells v/in0_reg/q_reg_4_] [get_cells v/in0_reg/q_reg_5_] [get_cells v/in0_reg/q_reg_6_] [get_cells v/in0_reg/q_reg_7_] [get_cells v/in0_reg/q_reg_8_] [get_cells v/in0_reg/q_reg_9_] [get_cells v/in0_reg/q_reg_10_] [get_cells v/in0_reg/q_reg_11_] [get_cells v/in0_reg/q_reg_12_] [get_cells v/in0_reg/q_reg_13_] [get_cells v/in0_reg/q_reg_14_] [get_cells v/in0_reg/q_reg_15_] [get_cells v/in0_reg/q_reg_16_] [get_cells v/in0_reg/q_reg_17_] [get_cells v/in0_reg/q_reg_18_] [get_cells v/in0_reg/q_reg_19_] [get_cells v/in0_reg/q_reg_20_] [get_cells v/in0_reg/q_reg_21_] [get_cells v/in0_reg/q_reg_22_] [get_cells v/in0_reg/q_reg_23_] [get_cells v/in0_reg/q_reg_24_] [get_cells v/in0_reg/q_reg_25_] [get_cells v/in0_reg/q_reg_26_] [get_cells v/in0_reg/q_reg_27_] [get_cells v/in0_reg/q_reg_28_] [get_cells v/in0_reg/q_reg_29_] [get_cells v/in0_reg/q_reg_30_] [get_cells v/in0_reg/q_reg_31_] [get_cells v/val_reg/q_reg_0_]]
group_path -name REGIN  -from [list [get_ports {reset[0]}] [get_ports {istream_msg[69]}] [get_ports {istream_msg[68]}] [get_ports {istream_msg[67]}] [get_ports {istream_msg[66]}] [get_ports {istream_msg[65]}] [get_ports {istream_msg[64]}] [get_ports {istream_msg[63]}] [get_ports {istream_msg[62]}] [get_ports {istream_msg[61]}] [get_ports {istream_msg[60]}] [get_ports {istream_msg[59]}] [get_ports {istream_msg[58]}] [get_ports {istream_msg[57]}] [get_ports {istream_msg[56]}] [get_ports {istream_msg[55]}] [get_ports {istream_msg[54]}] [get_ports {istream_msg[53]}] [get_ports {istream_msg[52]}] [get_ports {istream_msg[51]}] [get_ports {istream_msg[50]}] [get_ports {istream_msg[49]}] [get_ports {istream_msg[48]}] [get_ports {istream_msg[47]}] [get_ports {istream_msg[46]}] [get_ports {istream_msg[45]}] [get_ports {istream_msg[44]}] [get_ports {istream_msg[43]}] [get_ports {istream_msg[42]}] [get_ports {istream_msg[41]}] [get_ports {istream_msg[40]}] [get_ports {istream_msg[39]}] [get_ports {istream_msg[38]}] [get_ports {istream_msg[37]}] [get_ports {istream_msg[36]}] [get_ports {istream_msg[35]}] [get_ports {istream_msg[34]}] [get_ports {istream_msg[33]}] [get_ports {istream_msg[32]}] [get_ports {istream_msg[31]}] [get_ports {istream_msg[30]}] [get_ports {istream_msg[29]}] [get_ports {istream_msg[28]}] [get_ports {istream_msg[27]}] [get_ports {istream_msg[26]}] [get_ports {istream_msg[25]}] [get_ports {istream_msg[24]}] [get_ports {istream_msg[23]}] [get_ports {istream_msg[22]}] [get_ports {istream_msg[21]}] [get_ports {istream_msg[20]}] [get_ports {istream_msg[19]}] [get_ports {istream_msg[18]}] [get_ports {istream_msg[17]}] [get_ports {istream_msg[16]}] [get_ports {istream_msg[15]}] [get_ports {istream_msg[14]}] [get_ports {istream_msg[13]}] [get_ports {istream_msg[12]}] [get_ports {istream_msg[11]}] [get_ports {istream_msg[10]}] [get_ports {istream_msg[9]}] [get_ports {istream_msg[8]}] [get_ports {istream_msg[7]}] [get_ports {istream_msg[6]}] [get_ports {istream_msg[5]}] [get_ports {istream_msg[4]}] [get_ports {istream_msg[3]}] [get_ports {istream_msg[2]}] [get_ports {istream_msg[1]}] [get_ports {istream_msg[0]}] [get_ports {istream_val[0]}] [get_ports {ostream_rdy[0]}]]
group_path -name REGOUT  -to [list [get_ports {istream_rdy[0]}] [get_ports {ostream_msg[34]}] [get_ports {ostream_msg[33]}] [get_ports {ostream_msg[32]}] [get_ports {ostream_msg[31]}] [get_ports {ostream_msg[30]}] [get_ports {ostream_msg[29]}] [get_ports {ostream_msg[28]}] [get_ports {ostream_msg[27]}] [get_ports {ostream_msg[26]}] [get_ports {ostream_msg[25]}] [get_ports {ostream_msg[24]}] [get_ports {ostream_msg[23]}] [get_ports {ostream_msg[22]}] [get_ports {ostream_msg[21]}] [get_ports {ostream_msg[20]}] [get_ports {ostream_msg[19]}] [get_ports {ostream_msg[18]}] [get_ports {ostream_msg[17]}] [get_ports {ostream_msg[16]}] [get_ports {ostream_msg[15]}] [get_ports {ostream_msg[14]}] [get_ports {ostream_msg[13]}] [get_ports {ostream_msg[12]}] [get_ports {ostream_msg[11]}] [get_ports {ostream_msg[10]}] [get_ports {ostream_msg[9]}] [get_ports {ostream_msg[8]}] [get_ports {ostream_msg[7]}] [get_ports {ostream_msg[6]}] [get_ports {ostream_msg[5]}] [get_ports {ostream_msg[4]}] [get_ports {ostream_msg[3]}] [get_ports {ostream_msg[2]}] [get_ports {ostream_msg[1]}] [get_ports {ostream_msg[0]}] [get_ports {ostream_val[0]}]]
set_input_delay -clock ideal_clock  0.15  [get_ports {clk[0]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {reset[0]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[69]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[68]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[67]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[66]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[65]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[64]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[63]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[62]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[61]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[60]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[59]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[58]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[57]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[56]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[55]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[54]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[53]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[52]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[51]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[50]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[49]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[48]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[47]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[46]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[45]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[44]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[43]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[42]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[41]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[40]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[39]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[38]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[37]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[36]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[35]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[34]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[33]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[32]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[31]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[30]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[29]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[28]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[27]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[26]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[25]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[24]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[23]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[22]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[21]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[20]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[19]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[18]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[17]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[16]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[15]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[14]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[13]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[12]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[11]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[10]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[9]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[8]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[7]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[6]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[5]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[4]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[3]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[2]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[1]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_msg[0]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {istream_val[0]}]
set_input_delay -clock ideal_clock  0.15  [get_ports {ostream_rdy[0]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {istream_rdy[0]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[34]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[33]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[32]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[31]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[30]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[29]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[28]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[27]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[26]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[25]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[24]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[23]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[22]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[21]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[20]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[19]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[18]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[17]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[16]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[15]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[14]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[13]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[12]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[11]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[10]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[9]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[8]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[7]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[6]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[5]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[4]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[3]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[2]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[1]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_msg[0]}]
set_output_delay -clock ideal_clock  0.15  [get_ports {ostream_val[0]}]
